
slang_dict = {"具身智能":"指具有物理载体的智能体，最典型的例子就是人形机器人。具身智能的出现，标志着人工智能进入了一个新的发展阶段。",
        "数字游民":"指没有固定的办公场所，利用现代信息技术远程办公且具备良好自我管理能力的人群，他们以年轻人为主，在不同地区自由流动，打破了传统职业的地理限制。",
        "韧性":"作为流行语，“韧性”可指在不改变自身基本状态的前提下，有效对抗外部干扰、抵御外部冲击。面对复杂的外部环境,中国坚定不移办好自己的事，“韧性”因此成为热词。",
        "赛博对账":"2025年初，大量美国网民涌入小红书等中国社交平台，与中国网友交流互动，“赛博对账”为不同国家民众的信息交流与文化互动提供了借鉴。",
        "活人感":"指的是个人在社交媒体或日常生活中展现出的真实、生动的特质。“活人感”的流行，折射出智能时代人们对质朴人情味和温暖烟火气的向往。"}
slang_dict["苏超"] = "“江苏省城市足球联赛”的简称。自2025年5月10日在镇江体育会展中心体育场开幕以来，该联赛迅速火爆出圈。"

word = input("请输入你想查询的流行语：")
if word in slang_dict:
    print("你所查询的" + word + "释义如下：")
    print(slang_dict[word])
else:
    print("尚未收录该流行语！")
    print("我们目前已收录的流行语仅有" + str(len(slang_dict)) + "个！")